#문제
# 춘향이는 편의점 카운터에서 일한다.
# 손님이 2원짜리와 5원짜리로만 거스름돈을 달라고 한다. 2원짜리 동전과 5원짜리 동전은 무한정 많이 가지고 있다. 
# 동전의 개수가 최소가 되도록 거슬러 주어야 한다. 거스름돈이 n인 경우, 최소 동전의 개수가 몇 개인지 알려주는 프로그램을 작성하시오.
# 예를 들어, 거스름돈이 15원이면 5원짜리 3개를, 거스름돈이 14원이면 5원짜리 2개와 2원짜리 2개로 총 4개를, 
# 거스름돈이 13원이면 5원짜리 1개와 2원짜리 4개로 총 5개를 주어야 동전의 개수가 최소가 된다.

# 입력
# 첫째 줄에 거스름돈 액수 n(1 ≤ n ≤ 100,000)이 주어진다.

# 출력
# 거스름돈 동전의 최소 개수를 출력한다. 만약 거슬러 줄 수 없으면 -1을 출력한다.

coins = [0, 0]                                      # 리스트의 첫 번째 요소: 5원의 개수, 리스트의 두 번째 요소: 2원의 개수
n = int(input())

if n == 0 or n == 1 or n == 3:                      # 거슬러 줄 수 없는 경우
    print("-1")
else:
    coins[0] = n // 5                               # 그리디 (큰 수부터 나눠줘야 되서)
    if (n % 5) % 2 != 0:                            # 남은 돈을 2원으로 거슬러 줄 수 없는 경우 (5로 나눈 나머지가 홀수) ex) 13원
        coins[0] -= 1                               # 5원의 개수를 하나 줄이고
        coins[1] = (n - (coins[0] * 5)) // 2        # 남은 돈에 5을 추가해서 2로 나눈다.  (5로 나눈 나머지 (홀수) + 5(홀수) = 짝수 라서 2로 나눌수 있음)
        print(sum(coins))
    elif (n % 5) % 2 == 0:                          # 남은 돈을 2원으로 거슬러 줄 수 있는 경우 ex) 14원
        coins[1] = (n % 5) // 2
        print(sum(coins))
